Revit 2024 API
ViewShapeBuilder Members
The ViewShapeBuilder type exposes the following members.
Constructors
Name | Description
ViewShapeBuilder()
 Default constructor for an ViewShapeBuilder object.
ViewShapeBuilder(DirectShapeTargetViewType)
 A constructor for an ViewShapeBuilder object that takes a view type. It will infer the view normal from view type. View normal and view type are used to validate the geometry to be stored as a view-specific shape representation of a DirectShape object.
Methods
Name | Description
AddCurve
 Add a curve to the GRep associated to this ViewShapeBuilder.
Dispose |  (Inherited from ShapeBuilder.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Reset
 Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
ValidateCurve(Curve)
 Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call.
ValidateCurve(Curve, DirectShapeTargetViewType)
 Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException
ValidateShape
 Validates a shape represented as a collection of geometry objects for use as a view-specific shape. The objects are expected to be either points, curves or polylines. Curves are expected to be flat and lie in a plane perpendicular to view normal as defined by view type.
ValidateViewType
 Validates the incoming view type. As of today, the only allowed view type is Plan.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ShapeBuilder.)
ViewNormal
 Normal of the view that will display the shape being built. Must be set explicitly before adding any geometry. Must be a unit vector. This is used to validate incoming geometry - it must be orthogonal to the viewNormal.
ViewType
 View type where the view-specific shape currently being built will be used
See Also
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace